It wants to update the engine for some reason but only aurora_postgresql works.  when you try and use aurora-postgresql, it just errors out.

  # awscc_dms_data_provider.dms_data_provider_target will be updated in-place
  ~ resource "awscc_dms_data_provider" "dms_data_provider_target" {
      + data_provider_identifier    = (known after apply)
      + description                 = (known after apply)
      ~ engine                      = "aurora-postgresql" -> "aurora_postgresql"
        id                          = "arn:aws:dms:us-east-2:<number>:data-provider:EAIS6T77MFFMJKC4IR7D45UKMI"
      ~ settings                    = {
          + microsoft_sql_server_settings = (known after apply)
          + my_sql_settings               = (known after apply)
          + oracle_settings               = (known after apply)
          ~ postgre_sql_settings          = {
              + certificate_arn = (known after apply)
                # (4 unchanged attributes hidden)
            }
        }
      + tags                        = (known after apply)
        # (4 unchanged attributes hidden)
    }
